app/controllers/line_items_controller.rb

  def index
    @line_items = LineItem.all
---
SELECT "line_items".* FROM "line_items"

  def create
    product = Product.find(params[:product_id])
    @line_item = @cart.add_product(product.id)
    # @line_item = @cart.line_items.build(product: product)
    ## @line_item = LineItem.new(line_item_params)

    respond_to do |format|
      if @line_item.save
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? ORDER BY "products"."id" ASC LIMIT 1  [["id", 9]]
INSERT INTO "carts" ("created_at", "updated_at") VALUES (?, ?)  [["created_at", Fri, 06 Jun 2014 17:55:36 UTC +00:00], ["updated_at", Fri, 06 Jun 2014 17:55:36 UTC +00:00]]
INSERT INTO "line_items" ("cart_id", "created_at", "product_id", "updated_at") VALUES (?, ?, ?, ?)  [["cart_id", 1], ["created_at", Fri, 06 Jun 2014 17:55:36 UTC +00:00], ["product_id", 9], ["updated_at", Fri, 06 Jun 2014 17:55:36 UTC +00:00]]
UPDATE "line_items" SET "quantity" = ?, "updated_at" = ? WHERE "line_items"."id" = 2  [["quantity", 2], ["updated_at", Fri, 06 Jun 2014 18:25:41 UTC +00:00]]

  def destroy
    @line_item.destroy
---
DELETE FROM "line_items" WHERE "line_items"."id" = ?  [["id", 980190962]]

    def set_line_item
      @line_item = LineItem.find(params[:id])
---
SELECT "line_items".* FROM "line_items" WHERE "line_items"."id" = ? LIMIT 1  [["id", "980190962"]]