app/controllers/orders_controller.rb

SELECT "line_items".* FROM "line_items" WHERE "line_items"."cart_id" = ?  [["cart_id", 15]]
SELECT 1 AS one FROM "line_items" WHERE "line_items"."cart_id" = ? LIMIT 1  [["cart_id", 15]]
---
  def new
    @order = Order.new
    if @cart.line_items.empty?

INSERT INTO "orders" ("address", "created_at", "email", "name", "pay_type", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["address", "asdf"], ["created_at", Sun, 08 Jun 2014 22:20:36 UTC +00:00], ["email", "asdf"], ["name", "Seray"], ["pay_type", "Credit card"], ["updated_at", Sun, 08 Jun 2014 22:20:36 UTC +00:00]]
DELETE FROM "carts" WHERE "carts"."id" = ?  [["id", 17]]
---
  def create
    @order = Order.new(order_params)
    @order.add_line_items_from_cart(@cart)

    respond_to do |format|
      if @order.save
        Cart.destroy(session[:cart_id])