app/controllers/products_controller.rb

  def create
    @product = Product.new(product_params)

    respond_to do |format|
      if @product.save
---
INSERT INTO "products" ("created_at", "description", "image_url", "price", "title", "updated_at") VALUES (?, ?, ?, ?, ?, ?)

  def update
    respond_to do |format|
      if @product.update(product_params)
---
UPDATE "products" SET "image_url" = ?, "updated_at" = ? WHERE "products"."id" = 2  [["image_url", "http://talks.codegram.com/images/brew-your-own-coffeescript/coffeescript.png"], ["updated_at", Tue, 11 Mar 2014 13:49:36 UTC +00:00]]

  def destroy
    @product.destroy
---
DELETE FROM "products" WHERE "products"."id" = ?  [["id", 980190962]]

    def set_product
      @product = Product.find(params[:id])
---
SELECT "products".* FROM "products" WHERE "products"."id" = ? LIMIT 1  [["id", "980190962"]]